app/controllers/short_url_controller.rb

SELECT `short_urls`.* FROM `short_urls` ORDER BY click_count desc LIMIT 100
---
  def index                                                                     #Function when call GET localhost:3000
    short_urls = ShortUrl.order('click_count desc').limit(100);                 #Do a request in the DT, the result will be the top 100 sites most visited

INSERT INTO `short_urls` (`full_url`, `title`, `created_at`, `updated_at`) VALUES ('https://www.ltvco.com/blog/ltv-work-from-home-six-months-later/', 'wlm0', '2022-04-27 19:35:01.667254', '2022-04-27 19:35:01.667254')
---
  def create                                                                    #Function when call POST localhost:3000
    url = post_url[:fullurl]                                                    #Get the url that the user send in the params
    if validateURL(url)[0] === "200"                                            #Validate the URL
      short_url = shorter_url(url)
      fieldCollection = ShortUrl.new({full_url: url, title: short_url})         #Create a new instance of the model ShortUrl
      if fieldCollection.save                                                   #Save the instance in the Database

SELECT `short_urls`.`id` FROM `short_urls` WHERE (title = 'wlm0')
SELECT `short_urls`.`click_count` FROM `short_urls` WHERE (title = 'wlm0')
---
  def show                                                                                #Function when call GET localhost:3000/short_url_code
    fieldCollection = ShortUrl.where("title = ?", params[:title])                         #Get the register that has the short_url that has coincidence with the short_url introduced for the user
    if update_byId(fieldCollection.pluck(:id)[0], fieldCollection.pluck(:click_count)[0]) #Update the click_count of the register chosen
      redirect_to fieldCollection.pluck(:full_url)[0]                                     #If everything works ok redirect to the website

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 1 LIMIT 1
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-04-27 19:36:03.679061' WHERE `short_urls`.`id` = 1
---
  def update_byId(id, value)
    #Update the column "click_count" by the ID of it. Additionaly recieve an value that corresponds the amount of click_count of the page
    fieldCollection = ShortUrl.find(id)                           #Found the register for update
    if fieldCollection.update_attributes({click_count: value+1})  #Do the update, add + 1 because when this function execute means that one user use the short_url of the register

SELECT COUNT(*) FROM `short_urls`
---
  def getRecords                                             #Request for the database, return the amount of record that the database has
    return ShortUrl.count